Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/Core/Registers/rv32_csr.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2026 Laurent von Allmen
 *
 * Goal:        rv32_csr equates.
 */

#pragma once

// User level CSR addresses
// ------------------------

// User Trap Setup

#define RV_CSR_USTATUS                                  0x000U              //
#define RV_CSR_UIE                                      0x004U              //
#define RV_CSR_UTVEC                                    0x005U              //

// User Trap Handling

#define RV_CSR_USCRATCH                                 0x040U              //
#define RV_CSR_UEPC                                     0x041U              //
#define RV_CSR_UCAUSE                                   0x042U              //
#define RV_CSR_UTVAL                                    0x043U              //
#define RV_CSR_UIP                                      0x044U              //

// User Floating-point CSR

#define RV_CSR_FFLAGS                                   0x001U              //
#define RV_CSR_FRM                                      0x002U              //
#define RV_CSR_FCSR                                     0x003U              //

// User Counter/Timers

#define RV_CSR_CYCLE                                    0xC00U              //
#define RV_CSR_TIME                                     0xC01U              //
#define RV_CSR_INSTRET                                  0xC02U              //
#define RV_CSR_HPMCOUNTER3                              0xC03U              //
#define RV_CSR_HPMCOUNTER4                              0xC04U              //
#define RV_CSR_HPMCOUNTER5                              0xC05U              //
#define RV_CSR_HPMCOUNTER6                              0xC06U              //
#define RV_CSR_HPMCOUNTER7                              0xC07U              //
#define RV_CSR_HPMCOUNTER8                              0xC08U              //
#define RV_CSR_HPMCOUNTER9                              0xC09U              //
#define RV_CSR_HPMCOUNTER10                             0xC0AU              //
#define RV_CSR_HPMCOUNTER11                             0xC0BU              //
#define RV_CSR_HPMCOUNTER12                             0xC0CU              //
#define RV_CSR_HPMCOUNTER13                             0xC0DU              //
#define RV_CSR_HPMCOUNTER14                             0xC0EU              //
#define RV_CSR_HPMCOUNTER15                             0xC0FU              //
#define RV_CSR_HPMCOUNTER16                             0xC10U              //
#define RV_CSR_HPMCOUNTER17                             0xC11U              //
#define RV_CSR_HPMCOUNTER18                             0xC12U              //
#define RV_CSR_HPMCOUNTER19                             0xC13U              //
#define RV_CSR_HPMCOUNTER20                             0xC14U              //
#define RV_CSR_HPMCOUNTER21                             0xC15U              //
#define RV_CSR_HPMCOUNTER22                             0xC16U              //
#define RV_CSR_HPMCOUNTER23                             0xC17U              //
#define RV_CSR_HPMCOUNTER24                             0xC18U              //
#define RV_CSR_HPMCOUNTER25                             0xC19U              //
#define RV_CSR_HPMCOUNTER26                             0xC1AU              //
#define RV_CSR_HPMCOUNTER27                             0xC1BU              //
#define RV_CSR_HPMCOUNTER28                             0xC1CU              //
#define RV_CSR_HPMCOUNTER29                             0xC1DU              //
#define RV_CSR_HPMCOUNTER30                             0xC1EU              //
#define RV_CSR_HPMCOUNTER31                             0xC1FU              //
#define RV_CSR_CYCLEH                                   0xC80U              //
#define RV_CSR_TIMEH                                    0xC81U              //
#define RV_CSR_INSTRETH                                 0xC82U              //
#define RV_CSR_HPMCOUNTER3H                             0xC83U              //
#define RV_CSR_HPMCOUNTER4H                             0xC84U              //
#define RV_CSR_HPMCOUNTER5H                             0xC85U              //
#define RV_CSR_HPMCOUNTER6H                             0xC86U              //
#define RV_CSR_HPMCOUNTER7H                             0xC87U              //
#define RV_CSR_HPMCOUNTER8H                             0xC88U              //
#define RV_CSR_HPMCOUNTER9H                             0xC89U              //
#define RV_CSR_HPMCOUNTER10H                            0xC8AU              //
#define RV_CSR_HPMCOUNTER11H                            0xC8BU              //
#define RV_CSR_HPMCOUNTER12H                            0xC8CU              //
#define RV_CSR_HPMCOUNTER13H                            0xC8DU              //
#define RV_CSR_HPMCOUNTER14H                            0xC8EU              //
#define RV_CSR_HPMCOUNTER15H                            0xC8FU              //
#define RV_CSR_HPMCOUNTER16H                            0xC90U              //
#define RV_CSR_HPMCOUNTER17H                            0xC91U              //
#define RV_CSR_HPMCOUNTER18H                            0xC92U              //
#define RV_CSR_HPMCOUNTER19H                            0xC93U              //
#define RV_CSR_HPMCOUNTER20H                            0xC94U              //
#define RV_CSR_HPMCOUNTER21H                            0xC95U              //
#define RV_CSR_HPMCOUNTER22H                            0xC96U              //
#define RV_CSR_HPMCOUNTER23H                            0xC97U              //
#define RV_CSR_HPMCOUNTER24H                            0xC98U              //
#define RV_CSR_HPMCOUNTER25H                            0xC99U              //
#define RV_CSR_HPMCOUNTER26H                            0xC9AU              //
#define RV_CSR_HPMCOUNTER27H                            0xC9BU              //
#define RV_CSR_HPMCOUNTER28H                            0xC9CU              //
#define RV_CSR_HPMCOUNTER29H                            0xC9DU              //
#define RV_CSR_HPMCOUNTER30H                            0xC9EU              //
#define RV_CSR_HPMCOUNTER31H                            0xC9FU              //

// Supervisor level CSR addresses
// ------------------------------

