Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/Core/Registers/rv32_csr.h
// Supervisor Trap Setup

#define RV_CSR_SSTATUS                                  0x100U              //
#define RV_CSR_SEDELEG                                  0x102U              //
#define RV_CSR_SIDELEG                                  0x103U              //
#define RV_CSR_SIE                                      0x104U              //
#define RV_CSR_STVEC                                    0x105U              //
#define RV_CSR_SCOUNTEREN                               0x106U              //

// Supervisor Trap Handling

#define RV_CSR_SSCRATCH                                 0x140U              //
#define RV_CSR_SEPC                                     0x141U              //
#define RV_CSR_SCAUSE                                   0x142U              //
#define RV_CSR_SBADADDR                                 0x143U              //
#define RV_CSR_SIP                                      0x144U              //

// Supervisor Protection and Translation

#define RV_CSR_SPTBR                                    0x180U              //

// Hypervisor level CSR addresses
// ------------------------------

// Hypervisor Trap Setup

#define RV_CSR_HSTATUS                                  0x600U              //
#define RV_CSR_HEDELEG                                  0x602U              //
#define RV_CSR_HIDELEG                                  0x603U              //
#define RV_CSR_HIE                                      0x604U              //
#define RV_CSR_HCOUNTEREN                               0x606U              //
#define RV_CSR_HGEIE                                    0x607U              //

// Hypervisor Trap Handling

#define RV_CSR_HTVAL                                    0x643U              //
#define RV_CSR_HIP                                      0x644U              //
#define RV_CSR_HTINST                                   0x64AU              //
#define RV_CSR_HGEIP                                    0xE07U              //

// Hypervisor Protection and Translation

#define RV_CSR_HGATP                                    0x680U              //

// HypervisorCounter/Timers Visualization registers

#define RV_CSR_HTIMEDELTA                               0x605U              //
#define RV_CSR_HTIMEDELTAH                              0x615U              //

// Virtual Supervisor Registers

#define RV_CSR_VSTATUS                                  0x200U              //
#define RV_CSR_VSIE                                     0x204U              //
#define RV_CSR_VSTVEC                                   0x205U              //
#define RV_CSR_VSSCRATCH                                0x240U              //
#define RV_CSR_VSEPC                                    0x241U              //
#define RV_CSR_VSCAUSE                                  0x242U              //
#define RV_CSR_VSTVAL                                   0x243U              //
#define RV_CSR_VSIP                                     0x244U              //
#define RV_CSR_VSATP                                    0x280U              //

// Machine level CSR addresses
// ---------------------------

// Machine Information Registers

#define RV_CSR_MVENDORID                                0xF11U              //
#define RV_CSR_MARCHID                                  0xF12U              //
#define RV_CSR_MIMPID                                   0xF13U              //
#define RV_CSR_MHARTID                                  0xF14U              //

// Machine Trap Setup

#define RV_CSR_MSTATUS                                  0x300U              //
#define RV_CSR_MISA                                     0x301U              //
#define RV_CSR_MEDELEG                                  0x302U              //
#define RV_CSR_MIDELEG                                  0x303U              //
#define RV_CSR_MIE                                      0x304U              //
#define RV_CSR_MTVEC                                    0x305U              //
#define RV_CSR_MCOUNTEREN                               0x306U              //
#define RV_CSR_MSTATUSH                                 0x310U              //

// Machine Trap Handling

#define RV_CSR_MSCRATCH                                 0x340U              //
#define RV_CSR_MEPC                                     0x341U              //
#define RV_CSR_MCAUSE                                   0x342U              //
#define RV_CSR_MBADADDR                                 0x343U              //
#define RV_CSR_MIP                                      0x344U              //
#define RV_CSR_MTINST                                   0x34AU              //
#define RV_CSR_MTVAL2                                   0x34BU              //

// Machine MEMORY Protection

#define RV_CSR_PMPCFG0                                  0x3A0U              //
#define RV_CSR_PMPCFG1                                  0x3A1U              //
#define RV_CSR_PMPCFG2                                  0x3A2U              //
#define RV_CSR_PMPCFG3                                  0x3A3U              //
#define RV_CSR_PMPADDR0                                 0x3B0U              //
#define RV_CSR_PMPADDR1                                 0x3B1U              //
#define RV_CSR_PMPADDR2                                 0x3B2U              //
#define RV_CSR_PMPADDR3                                 0x3B3U              //
#define RV_CSR_PMPADDR4                                 0x3B4U              //
#define RV_CSR_PMPADDR5                                 0x3B5U              //
#define RV_CSR_PMPADDR6                                 0x3B6U              //
#define RV_CSR_PMPADDR7                                 0x3B7U              //
#define RV_CSR_PMPADDR8                                 0x3B8U              //
#define RV_CSR_PMPADDR9                                 0x3B9U              //
#define RV_CSR_PMPADDR10                                0x3BAU              //
#define RV_CSR_PMPADDR11                                0x3BBU              //
#define RV_CSR_PMPADDR12                                0x3BCU              //
#define RV_CSR_PMPADDR13                                0x3BDU              //
#define RV_CSR_PMPADDR14                                0x3BEU              //
#define RV_CSR_PMPADDR15                                0x3BFU              //

// Machine level CSR addresses
// ---------------------------

// Machine Counter/Timers

#define RV_CSR_MCYCLE                                   0xB00U              //
#define RV_CSR_MINSTRET                                 0xB02U              //
#define RV_CSR_MHPMCOUNTER3                             0xB03U              //
#define RV_CSR_MHPMCOUNTER4                             0xB04U              //
#define RV_CSR_MHPMCOUNTER5                             0xB05U              //
#define RV_CSR_MHPMCOUNTER6                             0xB06U              //
#define RV_CSR_MHPMCOUNTER7                             0xB07U              //
#define RV_CSR_MHPMCOUNTER8                             0xB08U              //
#define RV_CSR_MHPMCOUNTER9                             0xB09U              //
#define RV_CSR_MHPMCOUNTER10                            0xB0AU              //
#define RV_CSR_MHPMCOUNTER11                            0xB0BU              //
#define RV_CSR_MHPMCOUNTER12                            0xB0CU              //
#define RV_CSR_MHPMCOUNTER13                            0xB0DU              //
#define RV_CSR_MHPMCOUNTER14                            0xB0EU              //
#define RV_CSR_MHPMCOUNTER15                            0xB0FU              //
#define RV_CSR_MHPMCOUNTER16                            0xB10U              //
#define RV_CSR_MHPMCOUNTER17                            0xB11U              //
#define RV_CSR_MHPMCOUNTER18                            0xB12U              //
#define RV_CSR_MHPMCOUNTER19                            0xB13U              //
#define RV_CSR_MHPMCOUNTER20                            0xB14U              //
#define RV_CSR_MHPMCOUNTER21                            0xB15U              //
#define RV_CSR_MHPMCOUNTER22                            0xB16U              //
#define RV_CSR_MHPMCOUNTER23                            0xB17U              //
#define RV_CSR_MHPMCOUNTER24                            0xB18U              //
#define RV_CSR_MHPMCOUNTER25                            0xB19U              //
#define RV_CSR_MHPMCOUNTER26                            0xB1AU              //
#define RV_CSR_MHPMCOUNTER27                            0xB1BU              //
#define RV_CSR_MHPMCOUNTER28                            0xB1CU              //
#define RV_CSR_MHPMCOUNTER29                            0xB1DU              //
#define RV_CSR_MHPMCOUNTER30                            0xB1EU              //
#define RV_CSR_MHPMCOUNTER31                            0xB1FU              //
#define RV_CSR_MCYCLEH                                  0xB80U              //
#define RV_CSR_MINSTRETH                                0xB82U              //
#define RV_CSR_MHPMCOUNTER3H                            0xB83U              //
#define RV_CSR_MHPMCOUNTER4H                            0xB84U              //
#define RV_CSR_MHPMCOUNTER5H                            0xB85U              //
#define RV_CSR_MHPMCOUNTER6H                            0xB86U              //
#define RV_CSR_MHPMCOUNTER7H                            0xB87U              //
#define RV_CSR_MHPMCOUNTER8H                            0xB88U              //
#define RV_CSR_MHPMCOUNTER9H                            0xB89U              //
#define RV_CSR_MHPMCOUNTER10H                           0xB8AU              //
#define RV_CSR_MHPMCOUNTER11H                           0xB8BU              //
#define RV_CSR_MHPMCOUNTER12H                           0xB8CU              //
#define RV_CSR_MHPMCOUNTER13H                           0xB8DU              //
#define RV_CSR_MHPMCOUNTER14H                           0xB8EU              //
#define RV_CSR_MHPMCOUNTER15H                           0xB8FU              //
#define RV_CSR_MHPMCOUNTER16H                           0xB90U              //
#define RV_CSR_MHPMCOUNTER17H                           0xB91U              //
#define RV_CSR_MHPMCOUNTER18H                           0xB92U              //
#define RV_CSR_MHPMCOUNTER19H                           0xB93U              //
#define RV_CSR_MHPMCOUNTER20H                           0xB94U              //
#define RV_CSR_MHPMCOUNTER21H                           0xB95U              //
#define RV_CSR_MHPMCOUNTER22H                           0xB96U              //
#define RV_CSR_MHPMCOUNTER23H                           0xB97U              //
#define RV_CSR_MHPMCOUNTER24H                           0xB98U              //
#define RV_CSR_MHPMCOUNTER25H                           0xB99U              //
#define RV_CSR_MHPMCOUNTER26H                           0xB9AU              //
#define RV_CSR_MHPMCOUNTER27H                           0xB9BU              //
#define RV_CSR_MHPMCOUNTER28H                           0xB9CU              //
#define RV_CSR_MHPMCOUNTER29H                           0xB9DU              //
#define RV_CSR_MHPMCOUNTER30H                           0xB9EU              //
#define RV_CSR_MHPMCOUNTER31H                           0xB9FU              //

// Machine Counter Setup

#define RV_CSR_MUCOUNTEREN                              0x320U              //
#define RV_CSR_MSCOUNTEREN                              0x321U              //
#define RV_CSR_MHPMEVENT3                               0x323U              //
#define RV_CSR_MHPMEVENT4                               0x324U              //
#define RV_CSR_MHPMEVENT5                               0x325U              //
#define RV_CSR_MHPMEVENT6                               0x326U              //
#define RV_CSR_MHPMEVENT7                               0x327U              //
#define RV_CSR_MHPMEVENT8                               0x328U              //
#define RV_CSR_MHPMEVENT9                               0x329U              //
#define RV_CSR_MHPMEVENT10                              0x32AU              //
#define RV_CSR_MHPMEVENT11                              0x32BU              //
#define RV_CSR_MHPMEVENT12                              0x32CU              //
#define RV_CSR_MHPMEVENT13                              0x32DU              //
#define RV_CSR_MHPMEVENT14                              0x32EU              //
#define RV_CSR_MHPMEVENT15                              0x32FU              //
#define RV_CSR_MHPMEVENT16                              0x330U              //
#define RV_CSR_MHPMEVENT17                              0x331U              //
#define RV_CSR_MHPMEVENT18                              0x332U              //
#define RV_CSR_MHPMEVENT19                              0x333U              //
#define RV_CSR_MHPMEVENT20                              0x334U              //
#define RV_CSR_MHPMEVENT21                              0x335U              //
#define RV_CSR_MHPMEVENT22                              0x336U              //
#define RV_CSR_MHPMEVENT23                              0x337U              //
#define RV_CSR_MHPMEVENT24                              0x338U              //
#define RV_CSR_MHPMEVENT25                              0x339U              //
#define RV_CSR_MHPMEVENT26                              0x33AU              //
#define RV_CSR_MHPMEVENT27                              0x33BU              //
#define RV_CSR_MHPMEVENT28                              0x33CU              //
#define RV_CSR_MHPMEVENT29                              0x33DU              //
#define RV_CSR_MHPMEVENT30                              0x33EU              //
#define RV_CSR_MHPMEVENT31                              0x33FU              //

// Debug/Trace Registers (shared with Debug Mode)

#define RV_CSR_TSELECT                                  0x7A0U              //
#define RV_CSR_TDATA1                                   0x7A1U              //
#define RV_CSR_TDATA2                                   0x7A2U              //
#define RV_CSR_TDATA3                                   0x7A3U              //

// Debug Modee Register

