Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/Core/Registers/rv32_csr.h
#define RV_CSR_DCSR                                     0x7B0U              //
#define RV_CSR_DPC                                      0x7B1U              //
#define RV_CSR_DSCRATCH                                 0x7B2U              //

// Bits in registers
// -----------------

#define MSTATUS_UIE                                     (1U<<0)             //
#define MSTATUS_SIE                                     (1U<<1)             //
#define MSTATUS_HIE                                     (1U<<2)             //
#define MSTATUS_MIE                                     (1U<<3)             //
#define MSTATUS_UPIE                                    (1U<<4)             //
#define MSTATUS_SPIE                                    (1U<<5)             //
#define MSTATUS_HPIE                                    (1U<<6)             //
#define MSTATUS_MPIE                                    (1U<<7)             //
#define MSTATUS_SPP                                     (1U<<8)             //
#define MSTATUS_MPP                                     (3U<<11)            //
#define MSTATUS_FS                                      (3U<<13)            //
#define MSTATUS_XS                                      (3U<<15)            //
#define MSTATUS_MPRV                                    (1U<<17)            //
#define MSTATUS_PUM                                     (1U<<18)            //
#define MSTATUS_MXR                                     (1U<<19)            //
#define MSTATUS_VM                                      0x1F000000U         //
#define MSTATUS32_SD                                    0x80000000U         //
#define MSTATUS64_SD                                    0x8000000000000000U //

// MIE (Machine Interrupt Enable) register bit fields
#define MIE_USIE                                        (1U<<0)             // User software interrupt enable
#define MIE_SSIE                                        (1U<<1)             // Supervisor software interrupt enable
#define MIE_HSIE                                        (1U<<2)             // Hypervisor software interrupt enable
#define MIE_MSIE                                        (1U<<3)             // Machine software interrupt enable
#define MIE_UTIE                                        (1U<<4)             // User timer interrupt enable
#define MIE_STIE                                        (1U<<5)             // Supervisor timer interrupt enable
#define MIE_HTIE                                        (1U<<6)             // Hypervisor timer interrupt enable
#define MIE_MTIE                                        (1U<<7)             // Machine timer interrupt enable
#define MIE_UEIE                                        (1U<<8)             // User external interrupt enable
#define MIE_SEIE                                        (1U<<9)             // Supervisor external interrupt enable
#define MIE_HEIE                                        (1U<<10)            // Hypervisor external interrupt enable
#define MIE_MEIE                                        (1U<<11)            // Machine external interrupt enable

#define SSTATUS_UIE                                     0x00000001U         //
#define SSTATUS_SIE                                     0x00000002U         //
#define SSTATUS_UPIE                                    0x00000010U         //
#define SSTATUS_SPIE                                    0x00000020U         //
#define SSTATUS_SPP                                     0x00000100U         //
#define SSTATUS_FS                                      0x00006000U         //
#define SSTATUS_XS                                      0x00018000U         //
#define SSTATUS_PUM                                     0x00040000U         //
#define SSTATUS32_SD                                    0x80000000U         //
#define SSTATUS64_SD                                    0x8000000000000000U //

#define MCAUSE_INTERRUPT                                0x80000000U         //
#define MCAUSE_CAUSE                                    0x7FFFFFFFU         //

#define MCAUSE_EXC_CODE_INSTRUCTION_ADDRESS_MISALIGNED  0U                  //
#define MCAUSE_EXC_CODE_INSTRUCTION_ACCESS_FAULT        1U                  //
#define MCAUSE_EXC_CODE_ILLEGAL_INSTRUCTION             2U                  //
#define MCAUSE_EXC_CODE_BREAKPOINT                      3U                  //
#define MCAUSE_EXC_CODE_LOAD_ADDRESS_MISALIGNED         4U                  //
#define MCAUSE_EXC_CODE_LOAD_ACCESS_FAULT               5U                  //
#define MCAUSE_EXC_CODE_STORE_AMO_ADDRESS_MISALIGNED    6U                  //
#define MCAUSE_EXC_CODE_STORE_AMO_ACCESS_FAULT          7U                  //
#define MCAUSE_EXC_CODE_ENV_CALL_FROM_U_MODE            8U                  //
#define MCAUSE_EXC_CODE_ENV_CALL_FROM_S_MODE            9U                  //
#define MCAUSE_EXC_CODE_ENV_CALL_FROM_M_MODE            11U                 //
#define MCAUSE_EXC_CODE_INSTRUCTION_PAGE_FAULT          12U                 //
#define MCAUSE_EXC_CODE_LOAD_PAGE_FAULT                 13U                 //
#define MCAUSE_EXC_CODE_STORE_AMO_PAGE_FAULT            15U                 //

#define CSR_SETBITS(reg, mask) \
    ({ \
        uint32_t    __tmp; \
        if (__builtin_constant_p(mask) && ((uint32_t)(mask) < 32)) { \
            __asm volatile ("csrrs %0, " #reg ", %1" : "=r" (__tmp) : "i" (mask)); \
        } \
        else { \
            __asm volatile ("csrrs %0, " #reg ", %1" : "=r" (__tmp) : "r" (mask)); \
        } \
        __tmp; \
    })

#define CSR_CLEARBITS(reg, mask) \
    ({ \
        uint32_t    __tmp; \
        if (__builtin_constant_p(mask) && ((uint32_t)(mask) < 32)) { \
            __asm volatile ("csrrc %0, " #reg ", %1" : "=r" (__tmp) : "i" (mask)); \
        } \
        else { \
            __asm volatile ("csrrc %0, " #reg ", %1" : "=r" (__tmp) : "r" (mask)); \
        } \
        __tmp; \
    })

#define CSR_WRITE(reg, value) \
    ({ \
        if (__builtin_constant_p(value) && ((uint32_t)(value) < 32)) { \
            __asm volatile ("csrw " #reg ", %0" :: "i" (value)); \
        } \
        else { \
            __asm volatile ("csrw " #reg ", %0" :: "r" (value)); \
        } \
    })

#define CSR_READ(reg) \
    ({ \
        uint32_t    __tmp;  \
        __asm volatile ("csrr %0, " #reg : "=r" (__tmp)); \
        __tmp; \
    })

// Hazard3 custom CSRs (Xh3irq extension)
// Used for external interrupt management on RP2350 RISC-V

#define RV_CSR_MEIEA                                0xBE0U              // Machine External Interrupt Enable Array
#define RV_CSR_MEIPA                                0xBE1U              // Machine External Interrupt Pending Array
#define RV_CSR_MEIFA                                0xBE2U              // Machine External Interrupt Force Array
#define RV_CSR_MEIPRA                               0xBE3U              // Machine External Interrupt Priority Array
#define RV_CSR_MEINEXT                              0xBE4U              // Machine External Interrupt Next

// MEINEXT register fields (Hazard3 Xh3irq)
//
// On read:
//   bit 31    : noirq    (1 = no IRQ pending; bits 10:2 are then undefined)
//   bits 10:2 : irq      (the pending IRQ number, left-shifted by 2)
//   bit 0     : reads as 0
// On write (csrrs/csrrc):
//   bit 0     : update   (1 = atomically update meicontext.PREEMPT)

#define MEINEXT_NOIRQ                               (1U<<31)            // 1 = no IRQ pending
#define MEINEXT_IRQ_MASK                            (0x1FFU<<2)         // bits [10:2]
#define MEINEXT_IRQ_SHIFT                           2                   // shift to recover the IRQ number
#define MEINEXT_UPDATE                              (1U<<0)             // write side: update meicontext
